[
  {
    "name": "Pamela Calloway, Esq.",
    "title": "Executive Director and Board Member",
    "description": "Pamela brings deep experience in both workforce and regional economic development and a passion for the mission. She has served as Vice President of Programs for RDJ Enterprises, District Director for Congresswoman Barbara Lee (D-CA13), President of the Board of Commissioners for the Port of Oakland, and has advised mayors, Members of Congress, business associations and nonprofit organizations on the strategic use of resources to develop self-sustaining skills for those with barriers to employment. Pamela is a graduate of Fisk University, summa cum laude and Phi Beta Kappa and Georgetown University Law Center where she served as National Chair for the Black Law Students Association. Ms. Calloway is an active member of the State Bar of California. She is a graduate of TBP Bakery BootcampTM, an accomplishment that highlights her desire to understand the organization and those we serve."
  },
  {
    "name": "Gram Gould",
    "title": "Chef Instructor",
    "description": "Chef Gram began work at TBP on April 16. He has been Production Manager for Grateful Bread in Denver, Head Baker at West Town Bakery in Chicago and Kitchen Manager at Flagship Facilities Services in Menlo Park. More recently, he was Bread Chef at Facebook, Inc’s Menlo Park corporate headquarters where he managed the production of 40+ fresh baked goods daily! He is a graduate of The French Pastry School in Chicago where he studied with Chefs Sebastian Canonne MOF, Jacquey Pfifer, Bob Hartwig, Sebastian Thifienne, Laura Ragano and John Kraus. He has mastered proficiency in areas including frozen cakes/entremets, chocolate and sugar candies, tarts, breads, breakfast pastries, chocolate and sugar showpieces, wedding cakes, plated dessert, ice cream/sorbets, and jam making. He completed an externship at Pasticceia Bruno on Staten Island where he specialized in high volume production and worked with Chef/Owners Biaglo and Salvatore Settepani."
  },
  {
    "name": "Lynn Luckow",
    "title": "Chief Development Officer",
    "description": "Lynn most recently served as Interim Executive Director for TBP. Lynn is a senior advisor, consultant, speaker, coach and four-time CEO. He founded and led LikeMinded, Inc., a nationwide crowdfunding platform designed to assist nonprofit and civic enterprises expand engagement, funding and impact in their local communities. Prior to LikeMinded, he served as President & CEO of Craigslist Foundation, Northern California Grantmakers and Jossey-Bass Publishers. Lynn has served on or consulted to over 50 nonprofit boards, including chairing the national boards of Chanticleer, the Kinsey Institute, Project Open Hand and the National 4-H Council. Currently he serves on the boards of LikeMinded, Inc., Rotary Club of San Francisco, and Delta Upsilon International Fraternity, and on the advisory boards of Dive-In.co, Quarter Zero, Project Open Hand, Smuin Contemporary Ballet, and World Arts West."
  },
  {
    "name": "Usha Gongal",
    "title": "Production Manager",
    "description": "Usha has worked at TBP for several years in both teaching and production roles and has worked on a variety of product lines for TBP’s major business-to-business (wholesale) accounts. Usha has more than ten years’ experience as a market and manufacturing expert and trainer. Prior to joining TBP, she specialized in fashion design and merchandising. She founded a garment factory, Young WOW Craft, in Nepal, to empower women through microenterprise. She collaborated with the U.N. Development Program to train women and girls in the art of weaving cloth from paper in her factory. Young WOW Craft garments are sold globally with highest sales markets in Japan, South Korea, and Italy. Usha is passionate about sharing herknowledge of baking and her exceptional work ethic."
  },
  {
    "name": "Trent Cooper",
    "title": "Recruitment and Program Director",
    "description": "Trent joined TBP in January 2018. He has passion for food, nutrition, and health. Trent earned a BA in Foods and Nutrition at San Diego State University, and then spent time working with organizations to enhance the awareness of health: both exercise and nutrition. Trent’s experience also includes work in a hospital that focused on clinical nutrition for critically ill patients. Before joining TBP Trent worked with a Bay Area non-profit dedicated to combating food insecurity among vulnerable populations in Alameda County. Trent earned a MA in Public Administration at Cal State East Bay this May! Congratulations and welcome aboard full-time to Trent."
  },
  {
    "name": "Veronica Barron",
    "title": "Employment and Graduate Services Director",
    "description": "Veronica earned a BA from the University of California, Berkeley, studying Political Economy and Global Poverty this May! Veronica lives a deep commitment to serving vulnerable populations and has diverse experience doing so. She has spent the past several years providing mentorship and academic tutoring to at-risk high school students, lobbying for legislation that makes college more accessible and affordable, and providing legal information assistance for immigrants. Veronica joined TBP early in 2017 first as an intern and then as a Program Assistant. Congratulations and welcome aboard full-time to Veronica!"
  }
]
